validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/air_side_heater_2/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/air_side_heater_2";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
air_side_heater_2_to_fluid
{
 type calculated;
 value uniform 101325;
}
".*"
{
 type calculated;
 value uniform 101325;
}
}
