validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/fluid/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0.47194744999999994 0);
boundaryField
{
rack_walls
{
 type noSlip;
}
test_inlet
{
 type pressureInletOutletVelocity;
 value uniform (0 0 0);
}
test_outlet
{
 type pressureInletOutletVelocity;
 value uniform (0 0 0);
}
fluid_to_test_heater_0
{
 type noSlip;
}
fluid_to_homogeneous_heater_1
{
 type noSlip;
}
fluid_to_air_side_heater_2
{
 type noSlip;
}
}
