validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/fluid/alphat
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      alphat;
}

dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
rack_walls
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
test_inlet
{
 type calculated;
 value uniform 0;
}
test_outlet
{
 type calculated;
 value uniform 0;
}
fluid_to_test_heater_0
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
fluid_to_homogeneous_heater_1
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
fluid_to_air_side_heater_2
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
}
