validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/fluid/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
rack_walls
{
 type zeroGradient;
}
test_inlet
{
 type calculated;
 value uniform 101325;
}
test_outlet
{
 type fixedValue;
 value uniform 101325.000000;
}
fluid_to_test_heater_0
{
 type zeroGradient;
}
fluid_to_homogeneous_heater_1
{
 type zeroGradient;
}
fluid_to_air_side_heater_2
{
 type zeroGradient;
}
}
