validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/fluid/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
rack_walls
{
 type fixedFluxPressure;
 value uniform 101325.000000;
}
test_inlet
{
 type fanPressure;
 direction in;
 fanCurve
 {
  type table;
  outOfBounds clamp;
  values
  (
   (0 1.53125)
   (0.05 1.28625)
   (0.1 1.06167)
   (0.15 0.8575)
   (0.2 0.67375)
   (0.25 0.510417)
   (0.3 0.3675)
   (0.35 0.245)
   (0.4 0.142917)
   (0.45 0.06125)
   (0.5 0)
   (0.55 0)
   (0.6 0)
   (0.65 0)
   (0.7 0)
   (0.75 0)
   (0.8 0)
   (0.85 0)
   (0.9 0)
   (0.95 0)
   (1 0)
  );
 }
 p0 uniform 101325;
 value uniform 101325;
}
test_outlet
{
 type fixedValue;
 value uniform 101325.000000;
}
fluid_to_test_heater_0
{
 type fixedFluxPressure;
 value uniform 101325.000000;
}
fluid_to_homogeneous_heater_1
{
 type fixedFluxPressure;
 value uniform 101325.000000;
}
fluid_to_air_side_heater_2
{
 type fixedFluxPressure;
 value uniform 101325.000000;
}
}
