validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/homogeneous_heater_1/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/homogeneous_heater_1";
    object      T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 293.14999999999998;
boundaryField
{
homogeneous_heater_1_to_fluid
{
 type compressible::turbulentTemperatureRadCoupledMixed;
 Tnbr T;
 kappaMethod solidThermo;
 useImplicit false;
 qrNbr none;
 qr none;
 value uniform 293.14999999999998;
}
".*"
{
 type zeroGradient;
}
}
