validation/openfoam_solver_attestation_microcase_template_2026-08-27/0/porous_perforated_tray_0_mask
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porous_perforated_tray_0_mask;
}

dimensions [0 0 0 0 0 0 0];
internalField nonuniform List<scalar>
20
(
0
0
0
1
0
0
0
1
0
0
0
0
0
0
0
0
0
0
0
0
)
;
boundaryField
{
 ".*"
 { type calculated; value uniform 0; }
}
