validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/air_side_heater_2/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/air_side_heater_2";
    object      fvOptions;
}

// No stamped heat sources.
