validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/air_side_heater_2/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/air_side_heater_2";
    object      radiationProperties;
}

radiation off;
radiationModel none;
