validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/fluid/fvOptions.flowOnly
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      fvOptions;
}

porous_perforated_tray_0
{
 type explicitPorositySource;
 explicitPorositySourceCoeffs
 {
  selectionMode cellZone;
  cellZone porous_perforated_tray_0;
  type DarcyForchheimer;
  d (0 50000000 50000000);
  f (1250 50000 50000);
  coordinateSystem
  {
   origin (0 0 0);
   e1 (1 0 0);
   e3 (0 0 1);
  }
 }
}
