validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/fluid/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      radiationProperties;
}

radiation off;
radiationModel none;
