validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/fluid/thermophysicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}

thermoType
{
 type heRhoThermo;
 mixture pureMixture;
 transport const;
 thermo hConst;
 equationOfState rhoConst;
 specie specie;
 energy sensibleEnthalpy;
}
dpdt no;
mixture
{
 specie { molWeight 28.97; }
 equationOfState { rho 1.2250000000000001; }
 thermodynamics { Cp 1005; Hf 0; }
 transport { mu 1.8e-05; Pr 0.70999999999999996; }
}
