validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/fluid/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      turbulenceProperties;
}

simulationType RAS;
RAS
{
 RASModel kOmegaSST;
 turbulence on;
 printCoeffs on;
}
