validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/g
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 0 0);
