validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/homogeneous_heater_1/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/homogeneous_heater_1";
    object      radiationProperties;
}

radiation off;
radiationModel none;
