validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/openfoamExportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      openfoamExportProperties;
}

expectedConnectedFluidRegions 1;

heatSources
(
{
    name             test_heat_source_0;
    componentRegion  test_heater_0;
    solverRegion     solid;
    watts            10;
    selectedVolume   0.0010000000000000002;
    volumetricPower  9999.9999999999982;
}
{
    name             homogeneous_heater_load_1;
    componentRegion  homogeneous_heater_1;
    solverRegion     solid;
    watts            7;
    selectedVolume   0.0010000000000000002;
    volumetricPower  6999.9999999999982;
}
{
    name             heated_internal_air_2;
    componentRegion  air_side_heater_2;
    solverRegion     fluid;
    watts            5;
    selectedVolume   0.0010000000000000002;
    volumetricPower  4999.9999999999991;
}
);
