validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/regionProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      regionProperties;
}

regions
(
    fluid       (fluid)
    solid       (test_heater_0 homogeneous_heater_1 air_side_heater_2)
);
