validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/test_heater_0/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/test_heater_0";
    object      fvOptions;
}

test_heat_source_0_energy
{
 type scalarSemiImplicitSource;
 active true;
 selectionMode cellZone;
 cellZone test_heat_source_0;
 volumeMode absolute;
 sources { h (10 0); }
}
