validation/openfoam_solver_attestation_microcase_template_2026-08-27/constant/test_heater_0/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/test_heater_0";
    object      radiationProperties;
}

radiation off;
radiationModel none;
