validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/air_side_heater_2/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/air_side_heater_2";
    object      decomposeParDict;
}

#include "../decomposeParDict"
