validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/air_side_heater_2/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/air_side_heater_2";
    object      fvSchemes;
}

ddtSchemes { default Euler; }
gradSchemes { default Gauss linear; }
divSchemes { default none; }
laplacianSchemes
{
 default none;
 laplacian(alpha,h) Gauss linear corrected;
}
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
