validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/air_side_heater_2/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/air_side_heater_2";
    object      fvSolution;
}

solvers
{
 h { solver PCG; preconditioner DIC; tolerance 1e-6; relTol 0.1; }
 hFinal { $h; relTol 0; }
}
PIMPLE { nNonOrthogonalCorrectors 0; }
