validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 2;
method scotch;
regions
{
    test_heater_0
    {
        numberOfSubdomains 1;
        method simple;
        coeffs { n (1 1 1); }
    }
    homogeneous_heater_1
    {
        numberOfSubdomains 1;
        method simple;
        coeffs { n (1 1 1); }
    }
    air_side_heater_2
    {
        numberOfSubdomains 1;
        method simple;
        coeffs { n (1 1 1); }
    }
}
