validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/fluid/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSchemes;
}

ddtSchemes { default Euler; }
gradSchemes { default Gauss linear; }
divSchemes
{
 default none;
 div(phi,U) Gauss upwind;
 div(phi,K) Gauss linear;
 div(phi,h) Gauss upwind;
 turbulence Gauss upwind;
 div(phi,k) $turbulence;
 div(phi,omega) $turbulence;
 div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
