validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

PIMPLE
{
    nOuterCorrectors 3;
    pRefCell 0;
    pRefValue 101325;
}
