validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/homogeneous_heater_1/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/homogeneous_heater_1";
    object      decomposeParDict;
}

#include "../decomposeParDict"
