validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/test_heater_0/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/test_heater_0";
    object      decomposeParDict;
}

#include "../decomposeParDict"
