validation/openfoam_solver_attestation_microcase_template_2026-08-27/system/topoSetDict_test_heat_source_0
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict_test_heat_source_0;
}

actions
(
    {
        name    test_heat_source_0;
        type    cellSet;
        action  new;
        source  fieldToCell;
        field   heatSourceMask_0;
        min     0.5;
        max     1.5;
    }
    {
        name    test_heat_source_0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     test_heat_source_0;
    }
);
